/* Used when showing an invalid entry or input encountered when expecting a formal entry such as a number of date */
"\\U201c%@\\U201d" = "“%@”";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C" = "O valor é inválido.";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C.a" = "O valor %@ é inválido.";

/* NSKeyValueValidationError, suggestion string when a numeric value of an user input is invalid (for example too small or too large) */
"Err1024-R" = "Forneça um valor válido.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C" = "O valor é inválido.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C.a" = "O valor %@ é inválido.";

/* NSFormattingError, message shown when the numeric value of an entry or input is too small */
"Err2048-C.an" = "O valor é muito pequeno.";

/* NSFormattingError, message shown when the numeric value of an entry or input is too large */
"Err2048-C.ax" = "O valor é muito grande.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-R" = "Forneça um valor válido.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small */
"Err2048-R.n" = "Digite um número que não seja menor que %@.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small or too large */
"Err2048-R.nx" = "Digite um número entre %1$@ e %2$@.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too large */
"Err2048-R.x" = "Digite um número que não seja maior que %@.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.an" = "O valor %@ é pequeno demais.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.ax" = "O valor %@ é grande demais.";

/* NSFileLockingError */
"Err255-C" = "O arquivo não pôde ser bloqueado.";

/* NSFileLockingError */
"Err255-R" = "O arquivo pode já estar bloqueado ou talvez você não tenha permissão para bloqueá-lo.";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "O arquivo “%@” não pôde ser bloqueado.";

/* NSFileReadUnknownError */
"Err256" = "O arquivo não pôde ser aberto.";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "O arquivo “%@” não pôde ser aberto.";

/* NSFileReadNoPermissionError */
"Err257" = "O arquivo não pôde ser aberto porque você não tem permissão para vê-lo.";

/* NSFileReadNoPermissionError */
"Err257-C" = "Você não tem permissão.";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "Para ver ou alterar permissões, selecione o item no Finder e escolha Arquivo > Obter Informações.";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "O arquivo “%@” não pôde ser aberto porque você não tem permissão para vê-lo.";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "O nome do arquivo é inválido.";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "O item não pôde ser aberto porque o nome de arquivo “%@” é inválido.";

/* NSFileReadCorruptFileError */
"Err259" = "O arquivo não pôde ser aberto porque não está no formato correto.";

/* NSFileReadCorruptFileError */
"Err259-C" = "O arquivo não está no formato correto.";

/* NSFileReadCorruptFileError */
"Err259-R" = "O arquivo pode estar corrompido, truncado ou com um formato inesperado.";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "O arquivo “%@” não pôde ser aberto porque não está no formato correto.";

/* NSFileReadNoSuchFileError */
"Err260" = "O arquivo não pôde ser aberto porque não existe.";

/* NSFileReadNoSuchFileError */
"Err260(Folder).f" = "A pasta “%@” não existe.";

/* NSFileReadNoSuchFileError */
"Err260-C" = "O arquivo não existe.";

/* NSFileReadNoSuchFileError */
"Err260-C(Folder)" = "A pasta não existe.";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "O arquivo “%@” não pôde ser aberto porque tal arquivo não existe.";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "O arquivo não pôde ser aberto usando a codificação de texto especificada.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "A codificação de texto especificada não é aplicável.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "A codificação de texto %@ não é aplicável.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "O arquivo talvez tenha sido salvo usando uma codificação de texto diferente ou talvez não seja um arquivo de texto.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "O arquivo não pôde ser aberto usando a codificação de texto %@.";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "O arquivo “%2$@” não pôde ser aberto usando a codificação de texto %1$@.";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "O arquivo não pôde ser aberto porque o tipo de URL especificado não é compatível.";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "O tipo de URL especificado não é compatível.";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "O arquivo “%1$@” não pôde ser aberto porque o tipo de URL %2$@ não é compatível.";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "O arquivo não pôde ser aberto porque o tipo de URL %@ não é compatível.";

/* NSFileReadTooLargeError */
"Err263" = "O arquivo não pôde ser aberto porque é muito grande.";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "O arquivo é muito grande.";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "O arquivo “%@” não pôde ser aberto porque é muito grande.";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "O arquivo não pôde ser aberto porque a codificação de texto do conteúdo não pôde ser determinada.";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "A codificação de texto do conteúdo não pôde ser determinada.";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "Talvez você possa abrir o arquivo especificando uma codificação de texto.";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "O arquivo “%@” não pôde ser aberto porque a codificação de texto do seu conteúdo não pode ser determinada.";

/* NSUserCancelledError */
"Err3072-C" = "A operação foi cancelada.";

/* NSPropertyListCorruptError */
"Err3840" = "Os dados não puderam ser lidos porque foram corrompidos.";

/* NSPropertyListCorruptError */
"Err3840-C" = "Os dados foram corrompidos.";

/* NSPropertyListUnknownVersionError */
"Err3841" = "Os dados não puderam ser lidos porque estão em um formato que este aplicativo não compreende.";

/* NSPropertyListUnknownVersionError */
"Err3841-C" = "Os dados estão em um formato que este aplicativo não compreende.";

/* NSPropertyListReadStreamError */
"Err3842" = "Os dados não puderam ser lidos devido a um erro na fonte dos dados.";

/* NSPropertyListReadStreamError */
"Err3842-C" = "Ocorreu um erro na fonte dos dados.";

/* NSPropertyListWriteStreamError */
"Err3851" = "Os dados não puderam ser gravados devido a um erro no destino dos dados.";

/* NSPropertyListWriteStreamError */
"Err3851-C" = "Ocorreu um erro no destino dos dados.";

/* NSFileNoSuchFileError, argument is a folder name */
"Err4(Folder).f" = "A pasta “%@” não existe.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "“%@” não pôde ser removido.";

/* NSFileNoSuchFileError */
"Err4-C" = "O arquivo não existe.";

/* NSFileNoSuchFileError, applied to a folder */
"Err4-C(Folder)" = "A pasta não existe.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "O arquivo “%@” não existe.";

/* NSFileWriteUnknownError */
"Err512" = "O arquivo não pôde ser salvo.";

/* NSFileWriteUnknownError, when the save of the specified file fails because the backup file for the saved file can't be created or updated */
"Err512(Backup).f" = "O arquivo “%1$@” não pôde ser salvo porque o arquivo de backup não pôde ser atualizado.";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "“%1$@” não pôde ser copiado em “%2$@”.";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "“%1$@” não pôde ser vinculado a “%2$@”.";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "“%1$@” não pôde ser movido para “%2$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "“%@” não pôde ser removido.";

/* NSFileWriteUnknownError, when the save of a file fails because the backup file can't be created or updated */
"Err512-C(Backup)" = "O arquivo de backup não pôde ser salvo.";

/* NSFileWriteUnknownError, recovery suggestion for when the save of a file fails because the backup file can't be created or updated */
"Err512-R(Backup)" = "Talvez o arquivo de backup esteja bloqueado ou você não tenha permissão para salvá-lo. Para ver ou alterar as permissões, selecione o item no Finder e escolha Arquivo > Obter Informações.";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "O arquivo “%2$@” não pôde ser salvo na pasta “%1$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "O arquivo “%@” não pôde ser salvo.";

/* NSFileWriteNoPermissionError */
"Err513" = "O arquivo não pôde ser salvo porque você não tem permissão.";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "“%1$@” não pôde ser copiado porque você não tem permissão para acessar “%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "“%1$@” não pôde ser vinculado porque você não tem permissão para acessar “%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "“%1$@” não pôde ser movido porque você não tem permissão para acessar “%2$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "“%@” não pôde ser removido porque você não tem permissão para acessá-lo.";

/* NSFileWriteNoPermissionError */
"Err513-C" = "Você não tem permissão.";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "Para ver ou alterar permissões, selecione o item no Finder e escolha Arquivo > Obter Informações.";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "Você não tem permissão para salvar o arquivo “%2$@” na pasta “%1$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "Você não possui permissão para salvar o arquivo “%@”.";

/* NSFileWriteInvalidFileNameError */
"Err514" = "O item não pôde ser salvo porque o nome do arquivo é inválido.";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "The item não pôde ser removido porque o nome do arquivo “%@” é inválido.";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "O nome do arquivo é inválido.";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "O item não pôde ser salvo porque o nome do arquivo “%@” é inválido.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "O arquivo não pôde ser salvo usando a codificação de texto especificada.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "A codificação de texto especificada não é aplicável.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "A codificação de texto %@ não é aplicável.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "Se possível, selecione uma codificação de texto diferente.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "O arquivo não pôde ser salvo usando a codificação de texto %@.";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "O arquivo “%2$@” não pôde ser salvo usando a codificação de texto %1$@.";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "O arquivo não pôde ser aberto porque o tipo de URL especificado não é compatível.";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "O tipo de URL especificado não é compatível.";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "O arquivo “%1$@” não pôde ser salvo porque o tipo de URL %2$@ não é compatível.";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "O arquivo não pôde ser salvo porque o tipo de URL %@ não é compatível.";

/* NSFileWriteOutOfSpaceError */
"Err640" = "O arquivo não pôde ser salvo porque não há espaço suficiente.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "“%1$@” não pôde ser copiado em “%2$@” porque não há espaço suficiente.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "“%1$@” não pôde ser vinculado a “%2$@” porque não há espaço suficiente.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "“%1$@” não pôde ser movido para “%2$@” porque não há espaço suficiente.";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "Não há espaço suficiente.";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "Não há mais espaço no volume “%@”.";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "Remova alguns arquivos do volume e tente novamente.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "Você não pode salvar o arquivo “%@” porque não há espaço suficiente.";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "Você não pode salvar o arquivo “%1$@” porque não há espaço no volume “%2$@”.";

/* NSFileWriteVolumeReadOnlyError */
"Err642" = "O arquivo não pôde ser salvo porque o volume é apenas de leitura.";

/* NSFileWriteVolumeReadOnlyError */
"Err642-C" = "O volume é somente de leitura.";

/* NSFileWriteVolumeReadOnlyError, argument is volume name */
"Err642-C.v" = "O volume “%@” é somente de leitura.";

/* NSFileWriteVolumeReadOnlyError */
"Err642-R" = "Tente salvar o arquivo em outro volume.";

/* NSFileWriteVolumeReadOnlyError, argument is a file name */
"Err642.f" = "Você não pode salvar o arquivo “%@” porque o volume é somente de leitura.";

/* NSFileWriteVolumeReadOnlyError, arguments are file name and volume name */
"Err642.fv" = "Você não pode salvar o arquivo “%1$@” porque o volume “%2$@” é somente de leitura.";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"The operation couldn\\U2019t be completed. (%1$@ error %2$ld.)" = "A operação não pôde ser concluída. (%1$@ erro %2$ld.)";

